{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "CREDENTIAL_THEFT",
    "1": "DATA_EXFILTRATION",
    "2": "DATA_RESIDENCY_VIOLATION",
    "3": "DESTRUCTIVE_ACTION",
    "4": "KMS_TAMPERING",
    "5": "LATERAL_MOVEMENT",
    "6": "NETWORK_MANIPULATION",
    "7": "OBFUSCATION",
    "8": "PERSISTENCE",
    "9": "PRIVILEGE_ESCALATION",
    "10": "RANSOMWARE_SIGNATURE",
    "11": "SAFE",
    "12": "SEMANTIC_SMUGGLING"
  },
  "initializer_range": 0.02,
  "label2id": {
    "CREDENTIAL_THEFT": 0,
    "DATA_EXFILTRATION": 1,
    "DATA_RESIDENCY_VIOLATION": 2,
    "DESTRUCTIVE_ACTION": 3,
    "KMS_TAMPERING": 4,
    "LATERAL_MOVEMENT": 5,
    "NETWORK_MANIPULATION": 6,
    "OBFUSCATION": 7,
    "PERSISTENCE": 8,
    "PRIVILEGE_ESCALATION": 9,
    "RANSOMWARE_SIGNATURE": 10,
    "SAFE": 11,
    "SEMANTIC_SMUGGLING": 12
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
